lucasssvaz/arduino-esp32/libraries/BLE/src/scan/BLEScan.nimble.cpp
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2020-2025 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/**
 * @file BLEScan.nimble.cpp
 * @brief NimBLE (BLE 5) implementation of BLE scan discovery and related GAP events.
 */

#include "core/BLEGuards.h"
#if BLE_NIMBLE

#include "BLE.h"

#include "scan/BLEScan.nimble.h"
#include "scan/BLEAdvertisedDeviceImpl.h"
#include "scan/BLEScanImpl.h"
#include "core/BLEImplHelpers.h"
#include "advertising/BLEAdvScanHelpers.h"
#include "esp32-hal-log.h"
#if BLE_ISO_SUPPORTED
#include "audio/BLEAudioIso.nimble.h"
#endif
#if BLE_AUDIO_SUPPORTED
#include "audio/BLEAudioEngine.nimble.h"
#endif

#include <algorithm>

#if BLE_SCANNING_SUPPORTED

#include <host/ble_hs.h>
#include <host/ble_gap.h>

namespace {

/**
 * @brief Invokes the per-result callback with a discovered device, if set.
 * @param impl Scan implementation that holds callbacks and state.
 * @param device Device reported by the stack.
 */
void dispatchResult(BLEScan::Impl *impl, BLEAdvertisedDevice device) {
  BLEScan::ResultHandler cb;
  {
    BLELockGuard lock(impl->mtx);
    cb = impl->onResultCb;
  }
  if (cb) {
    cb(device);
  }
}

/**
 * @brief Merges or appends a scan result into the in-memory result list.
 * @param impl Scan implementation whose result list is updated.
 * @param device Advertised device to append or replace (by address).
 */
void appendOrReplaceResult(BLEScan::Impl *impl, const BLEAdvertisedDevice &device) {
  BLELockGuard lock(impl->mtx);
  impl->results.appendOrReplace(device);
}

/**
 * @brief Invokes the scan-complete callback with the current result set, if set.
 * @param impl Scan implementation that holds the callback and results.
 */
void dispatchComplete(BLEScan::Impl *impl) {
  BLEScan::CompleteHandler cb;
  BLEScan::Results results;
  {
    BLELockGuard lock(impl->mtx);
    cb = impl->onCompleteCb;
    results = impl->results;
  }
  if (cb) {
    cb(results);
  }
}

#if BLE5_SUPPORTED
/**
 * @brief Invokes the periodic advertising sync callback, if set.
 * @param impl Scan implementation that holds the callback.
 * @param syncHandle Periodic sync link handle from the stack.
 * @param sid Advertising set identifier.
 * @param addr Address of the periodic advertiser.
 * @param phy PHY used for the advertising train.
 * @param interval Periodic advertising interval (stack units).
 */
void dispatchPeriodicSync(BLEScan::Impl *impl, uint16_t syncHandle, uint8_t sid, const BTAddress &addr, BLEPhy phy, uint16_t interval) {
  BLEScan::PeriodicSyncHandler cb;
  {
    BLELockGuard lock(impl->mtx);
    cb = impl->periodicSyncCb;
  }
  if (cb) {
    cb(syncHandle, sid, addr, phy, interval);
  }
}

/**
 * @brief Invokes the periodic report callback with payload data, if set.
 * @param impl Scan implementation that holds the callback.
 * @param syncHandle Periodic sync link handle.
 * @param rssi Reported RSSI in dBm.
 * @param txPower Reported TX power if present.
 * @param data Pointer to advertising payload bytes (may be null if empty).
 * @param len Length of the payload in bytes.
 */
void dispatchPeriodicReport(BLEScan::Impl *impl, uint16_t syncHandle, int8_t rssi, int8_t txPower, const uint8_t *data, size_t len) {
  BLEScan::PeriodicReportHandler cb;
  {
    BLELockGuard lock(impl->mtx);
    cb = impl->periodicReportCb;
  }
  if (cb) {
    cb(syncHandle, rssi, txPower, data, len);
  }
}

/**
 * @brief Invokes the periodic sync lost callback, if set.
 * @param impl Scan implementation that holds the callback.
 * @param syncHandle Periodic sync link that was lost.
 */
void dispatchPeriodicLost(BLEScan::Impl *impl, uint16_t syncHandle) {
  BLEScan::PeriodicLostHandler cb;
  {
    BLELockGuard lock(impl->mtx);
    cb = impl->periodicLostCb;
  }
  if (cb) {
    cb(syncHandle);
  }
}
#endif

}  // namespace

/**
 * @brief Converts a legacy NimBLE discovery descriptor into a BLEAdvertisedDevice.
 * @param disc GAP discovery descriptor from NimBLE.
 * @return Wrapper around the parsed advertised device.
 */
BLEAdvertisedDevice BLEScan::Impl::parseDiscEvent(const struct ble_gap_disc_desc *disc) {
  auto impl = std::make_shared<BLEAdvertisedDevice::Impl>();
  impl->address = BTAddress(disc->addr.val, static_cast<BTAddress::Type>(disc->addr.type));
  impl->addrType = static_cast<BTAddress::Type>(disc->addr.type);
  impl->rssi = disc->rssi;
  impl->hasRSSI = true;
  impl->legacy = true;

  switch (disc->event_type) {
    case BLE_HCI_ADV_RPT_EVTYPE_ADV_IND:
      impl->connectable = true;
      impl->scannable = true;
      impl->advType = BLEAdvType::ConnectableScannable;
      break;
    case BLE_HCI_ADV_RPT_EVTYPE_DIR_IND:
      impl->connectable = true;
      impl->directed = true;
      impl->advType = BLEAdvType::ConnectableDirected;
      break;
    case BLE_HCI_ADV_RPT_EVTYPE_SCAN_IND:
      impl->scannable = true;
      impl->advType = BLEAdvType::ScannableUndirected;
      break;
    case BLE_HCI_ADV_RPT_EVTYPE_NONCONN_IND: impl->advType = BLEAdvType::NonConnectable; break;
    default:                                 break;
  }

  if (disc->length_data > 0 && disc->data != nullptr) {
    impl->parsePayload(disc->data, disc->length_data);
  }

  return BLEScanImplCommon::makeAdvertisedDeviceHandle(impl);
}

#if BLE5_SUPPORTED
/**
 * @brief Converts an extended (BLE 5) discovery descriptor into a BLEAdvertisedDevice.
 * @param disc Extended GAP discovery descriptor from NimBLE.
 * @return Wrapper around the parsed advertised device.
 */
BLEAdvertisedDevice BLEScan::Impl::parseExtDiscEvent(const struct ble_gap_ext_disc_desc *disc) {
  auto impl = std::make_shared<BLEAdvertisedDevice::Impl>();
  impl->address = BTAddress(disc->addr.val, static_cast<BTAddress::Type>(disc->addr.type));
  impl->addrType = static_cast<BTAddress::Type>(disc->addr.type);
  impl->rssi = disc->rssi;
  impl->hasRSSI = true;
  impl->legacy = (disc->props & BLE_HCI_ADV_LEGACY_MASK) != 0;
  impl->connectable = (disc->props & BLE_HCI_ADV_CONN_MASK) != 0;
  impl->scannable = (disc->props & BLE_HCI_ADV_SCAN_MASK) != 0;
  impl->directed = (disc->props & BLE_HCI_ADV_DIRECT_MASK) != 0;
  impl->primaryPhy = static_cast<BLEPhy>(disc->prim_phy);
  impl->secondaryPhy = static_cast<BLEPhy>(disc->sec_phy);
  impl->sid = disc->sid;
  impl->periodicInterval = disc->periodic_adv_itvl;
  if (disc->tx_power != 127) {
    impl->txPower = disc->tx_power;
    impl->hasTXPower = true;
  }

