lucasssvaz/arduino-esp32/libraries/BLE/src/scan/BLEScan.nimble.cpp
  if (disc->length_data > 0 && disc->data != nullptr) {
    impl->parsePayload(disc->data, disc->length_data);
  }

  return BLEScanImplCommon::makeAdvertisedDeviceHandle(impl);
}
#endif

/**
 * @brief NimBLE GAP event callback for scan, extended scan, and periodic sync events.
 * @param event GAP event from NimBLE.
 * @param arg User pointer to BLEScan::Impl.
 * @return 0 to indicate the event was handled (NimBLE convention); non-handled paths are not used here.
 */
int BLEScan::Impl::gapEventHandler(struct ble_gap_event *event, void *arg) {
  auto *impl = static_cast<BLEScan::Impl *>(arg);
  if (!impl) {
    return 0;
  }

#if BLE_ISO_SUPPORTED
  // Mirror periodic-sync / BIGInfo events into the ISO engine so an armed BIG
  // sync (BLEAudioIso::syncBig) fires on the train this scanner synced to.
  BLEAudioIso::forwardHostGapEvent(event);
#endif
#if BLE_AUDIO_SUPPORTED
  // Mirror ext-scan / periodic-sync events into the LE Audio engine so a BAP
  // Broadcast Sink can decode BASE/BIGInfo and drive its PA_SYNC lifecycle.
  BLEAudioEngine::forwardHostGapEvent(event);
#endif

  switch (event->type) {
    case BLE_GAP_EVENT_DISC:
    {
      if (event->disc.event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP) {
        BTAddress addr(event->disc.addr.val, static_cast<BTAddress::Type>(event->disc.addr.type));
        BLEAdvertisedDevice merged;
        bool found = false;
        {
          BLELockGuard lock(impl->mtx);
          // Legacy PDUs carry no ADI; match the legacy entry (SID 0xFF).
          found = BLEScanImplCommon::mergeScanResponse(
            impl->results, addr, 0xFF, event->disc.data, event->disc.length_data, event->disc.rssi, merged
          );
        }
        if (found) {
          dispatchResult(impl, merged);
          return 0;
        }
      }

      // Cache the result before invoking the callback so getResults() called from
      // inside onResult already includes this device.
      BLEAdvertisedDevice dev = impl->parseDiscEvent(&event->disc);
      appendOrReplaceResult(impl, dev);
      dispatchResult(impl, dev);
      return 0;
    }

    case BLE_GAP_EVENT_DISC_COMPLETE:
    {
      {
        BLELockGuard lock(impl->mtx);
        impl->isScanning = false;
      }
      dispatchComplete(impl);
      impl->scanSync.give(BTStatus::OK);
      return 0;
    }

#if BLE5_SUPPORTED
    case BLE_GAP_EVENT_EXT_DISC:
    {
      const struct ble_gap_ext_disc_desc &d = event->ext_disc;
      // A scan response carries the fields (notably the Local Name) that the
      // scanner solicited with SCAN_REQ; it must be merged into the device from
      // the preceding advertisement rather than surfaced as a nameless device.
      // Detect it via the ext-report properties (extended PDUs) or the
      // legacy_event_type (legacy PDUs reported over the extended API, which is
      // how an ext-adv-enabled controller reports everything). Mirrors the
      // BLE_GAP_EVENT_DISC scan-response handling above.
      const bool isScanRsp =
        (d.props & BLE_HCI_ADV_SCAN_RSP_MASK) != 0 || ((d.props & BLE_HCI_ADV_LEGACY_MASK) && d.legacy_event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP);
      if (isScanRsp) {
        BTAddress addr(d.addr.val, static_cast<BTAddress::Type>(d.addr.type));
        BLEAdvertisedDevice merged;
        bool found = false;
        {
          BLELockGuard lock(impl->mtx);
          found = BLEScanImplCommon::mergeScanResponse(impl->results, addr, d.sid, d.data, d.length_data, d.rssi, merged);
        }
        if (found) {
          dispatchResult(impl, merged);
          return 0;
        }
        // No prior advertisement to merge into: fall through and surface the
        // scan response as a standalone device so its name is not lost.
      }

      // Cache before invoking the callback (see BLE_GAP_EVENT_DISC).
      BLEAdvertisedDevice dev = impl->parseExtDiscEvent(&event->ext_disc);
      appendOrReplaceResult(impl, dev);
      dispatchResult(impl, dev);
      return 0;
    }

    case BLE_GAP_EVENT_PERIODIC_SYNC:
    {
      // Track successfully established syncs so BLE.end() can tear them down.
      if (event->periodic_sync.status == 0) {
        BLELockGuard lock(impl->mtx);
        impl->periodicSyncs.push_back(event->periodic_sync.sync_handle);
      }
      if (impl->periodicSyncCb) {
        BTAddress addr(event->periodic_sync.adv_addr.val, static_cast<BTAddress::Type>(event->periodic_sync.adv_addr.type));
        dispatchPeriodicSync(
          impl, event->periodic_sync.sync_handle, event->periodic_sync.sid, addr, static_cast<BLEPhy>(event->periodic_sync.adv_phy),
          event->periodic_sync.per_adv_ival
        );
      }
      return 0;
    }

#ifdef BLE_GAP_EVENT_PERIODIC_TRANSFER
    case BLE_GAP_EVENT_PERIODIC_TRANSFER:
#ifdef BLE_GAP_EVENT_PERIODIC_TRANSFER_V2
    case BLE_GAP_EVENT_PERIODIC_TRANSFER_V2:
#endif
    {
      if (event->periodic_transfer.status == 0) {
        BLELockGuard lock(impl->mtx);
        impl->periodicSyncs.push_back(event->periodic_transfer.sync_handle);
      }
      if (impl->periodicSyncCb && event->periodic_transfer.status == 0) {
        BTAddress addr(event->periodic_transfer.adv_addr.val, static_cast<BTAddress::Type>(event->periodic_transfer.adv_addr.type));
        dispatchPeriodicSync(
          impl, event->periodic_transfer.sync_handle, event->periodic_transfer.sid, addr, static_cast<BLEPhy>(event->periodic_transfer.adv_phy),
          event->periodic_transfer.per_adv_itvl
        );
      }
      return 0;
    }
#endif

    case BLE_GAP_EVENT_PERIODIC_REPORT:
    {
      if (impl->periodicReportCb) {
        // Newer NimBLE delivers the periodic report payload as a flat buffer
        // (const uint8_t *data + data_length) instead of an os_mbuf (.om).
        const uint8_t *data = event->periodic_report.data;
        size_t len = event->periodic_report.data_length;
        dispatchPeriodicReport(impl, event->periodic_report.sync_handle, event->periodic_report.rssi, event->periodic_report.tx_power, data, len);
      }
      return 0;
    }

