lucasssvaz/arduino-esp32/libraries/BLE/src/scan/BLEScan.nimble.cpp
    case BLE_GAP_EVENT_PERIODIC_SYNC_LOST:
    {
      {
        BLELockGuard lock(impl->mtx);
        auto &v = impl->periodicSyncs;
        v.erase(std::remove(v.begin(), v.end(), event->periodic_sync_lost.sync_handle), v.end());
      }
      if (impl->periodicLostCb) {
        dispatchPeriodicLost(impl, event->periodic_sync_lost.sync_handle);
      }
      return 0;
    }
#endif

    default: return 0;
  }
}

// --------------------------------------------------------------------------
// BLEScan public API
// --------------------------------------------------------------------------

// API contract is documented on the declarations in the public BLE*.h headers; the definitions below carry implementation notes only.

// No-op: NimBLE manages duplicate filtering internally.
void BLEScan::clearDuplicateCache() { /* NimBLE manages this internally */ }

BTStatus BLEScan::start(uint32_t durationMs, bool appendToExistingResults) {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (impl.isScanning && !appendToExistingResults) {
    stop();
  }

  if (!appendToExistingResults) {
    impl.results._devices.clear();
  }

  log_d("Scan: start duration=%u ms active=%d filterDuplicates=%d", durationMs, impl.activeScan, impl.filterDuplicates);

#if BLE5_SUPPORTED
  // On ext-adv-enabled controllers legacy ble_gap_disc results are delivered as
  // BLE_GAP_EVENT_EXT_DISC, so drive the extended discovery API directly (1M,
  // uncoded) and let the EXT_DISC handler merge scan responses.
  struct ble_gap_ext_disc_params uncoded = {};
  uncoded.passive = impl.activeScan ? 0 : 1;
  uncoded.itvl = impl.interval;
  uncoded.window = impl.window;

  int rc = ble_gap_ext_disc(
    static_cast<uint8_t>(BLE.getOwnAddressType()), durationMs == 0 ? 0 : (uint16_t)(durationMs / 10), 0, impl.filterDuplicates ? 1 : 0, 0, 0, &uncoded, NULL,
    BLEScan::Impl::gapEventHandler, &impl
  );
  if (rc != 0) {
    log_e("ble_gap_ext_disc: rc=%d", rc);
    return BTStatus::Fail;
  }
#else
  struct ble_gap_disc_params params = {};
  params.filter_duplicates = impl.filterDuplicates ? 1 : 0;
  params.passive = impl.activeScan ? 0 : 1;
  params.itvl = impl.interval;
  params.window = impl.window;
  params.filter_policy = 0;
  params.limited = 0;

  int rc =
    ble_gap_disc(static_cast<uint8_t>(BLE.getOwnAddressType()), durationMs == 0 ? BLE_HS_FOREVER : (int32_t)durationMs, &params, BLEScan::Impl::gapEventHandler, &impl);
  if (rc != 0) {
    log_e("ble_gap_disc: rc=%d", rc);
    return BTStatus::Fail;
  }
#endif
  impl.isScanning = true;
  return BTStatus::OK;
}

// Blocks until the scan completes or times out; completion is gated by the internal sync object.
BLEScan::Results BLEScan::startBlocking(uint32_t durationMs) {
  BLE_CHECK_IMPL(BLEScan::Results());
  impl.results._devices.clear();
  impl.scanSync.take();

#if BLE5_SUPPORTED
  // See BLEScan::start(): the ext-adv-enabled controller reports through
  // BLE_GAP_EVENT_EXT_DISC, so use the extended discovery API here too.
  struct ble_gap_ext_disc_params uncoded = {};
  uncoded.passive = impl.activeScan ? 0 : 1;
  uncoded.itvl = impl.interval;
  uncoded.window = impl.window;

  int rc = ble_gap_ext_disc(
    static_cast<uint8_t>(BLE.getOwnAddressType()), durationMs == 0 ? 0 : (uint16_t)(durationMs / 10), 0, impl.filterDuplicates ? 1 : 0, 0, 0, &uncoded, NULL,
    BLEScan::Impl::gapEventHandler, &impl
  );
  if (rc != 0) {
    impl.scanSync.give(BTStatus::Fail);
    log_e("ble_gap_ext_disc: rc=%d", rc);
    return BLEScan::Results();
  }
#else
  struct ble_gap_disc_params params = {};
  params.filter_duplicates = impl.filterDuplicates ? 1 : 0;
  params.passive = impl.activeScan ? 0 : 1;
  params.itvl = impl.interval;
  params.window = impl.window;

  int rc = ble_gap_disc(static_cast<uint8_t>(BLE.getOwnAddressType()), (int32_t)durationMs, &params, BLEScan::Impl::gapEventHandler, &impl);
  if (rc != 0) {
    impl.scanSync.give(BTStatus::Fail);
    log_e("ble_gap_disc: rc=%d", rc);
    return BLEScan::Results();
  }
#endif
  impl.isScanning = true;
  impl.scanSync.wait(durationMs + 2000);
  return impl.results;
}

BTStatus BLEScan::stop() {
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  if (!impl.isScanning) {
    return BTStatus::OK;
  }
  log_d("Scan: stop");
  int rc = ble_gap_disc_cancel();
  impl.isScanning = false;
  if (rc != 0 && rc != BLE_HS_EALREADY) {
    log_e("Scan: ble_gap_disc_cancel rc=%d", rc);
    return BTStatus::Fail;
  }
  return BTStatus::OK;
}

BTStatus BLEScan::startExtended(uint32_t durationMs, const ExtScanConfig *codedConfig, const ExtScanConfig *uncodedConfig) {
#if BLE5_SUPPORTED
  BLE_CHECK_IMPL(BTStatus::InvalidState);
  impl.results._devices.clear();

  struct ble_gap_ext_disc_params uncodedParams = {};
  struct ble_gap_ext_disc_params codedParams = {};
  uint8_t active = impl.activeScan ? 1 : 0;

  // ExtScanConfig interval/window are in milliseconds (matching setInterval/setWindow);
  // impl.interval/impl.window are already stored in 0.625 ms controller units.
  uncodedParams.passive = !active;
  uncodedParams.itvl = uncodedConfig ? bleMsToUnits0625(uncodedConfig->interval) : impl.interval;
  uncodedParams.window = uncodedConfig ? bleMsToUnits0625(uncodedConfig->window) : impl.window;

  codedParams.passive = !active;
  codedParams.itvl = codedConfig ? bleMsToUnits0625(codedConfig->interval) : impl.interval;
  codedParams.window = codedConfig ? bleMsToUnits0625(codedConfig->window) : impl.window;

  int rc = ble_gap_ext_disc(
    static_cast<uint8_t>(BLE.getOwnAddressType()), durationMs == 0 ? 0 : (durationMs / 10), 0, impl.filterDuplicates ? 1 : 0, 0, 0, &uncodedParams,
    codedConfig ? &codedParams : NULL, BLEScan::Impl::gapEventHandler, &impl
  );
  if (rc != 0) {
    log_e("ble_gap_ext_disc: rc=%d", rc);
    return BTStatus::Fail;
  }
  impl.isScanning = true;
  return BTStatus::OK;
#else
  log_w("Scan: startExtended not supported (BLE 5.0 unavailable)");
  return BTStatus::NotSupported;
#endif
}

// Delegates to stop() on NimBLE.
BTStatus BLEScan::stopExtended() {
  return stop();
}

BTStatus BLEScan::createPeriodicSync(const BTAddress &addr, uint8_t sid, uint16_t skipCount, uint16_t timeoutMs) {
#if BLE5_SUPPORTED
  BLE_CHECK_IMPL(BTStatus::InvalidState);

  struct ble_gap_periodic_sync_params params = {};
  params.skip = skipCount;
  params.sync_timeout = timeoutMs / 10;

  ble_addr_t bleAddr;
  bleAddr.type = static_cast<uint8_t>(addr.type());
  memcpy(bleAddr.val, addr.data(), 6);

  int rc = ble_gap_periodic_adv_sync_create(&bleAddr, sid, &params, BLEScan::Impl::gapEventHandler, &impl);
  if (rc != 0) {
    log_e("ble_gap_periodic_adv_sync_create: rc=%d", rc);
    return BTStatus::Fail;
  }
  return BTStatus::OK;
#else
  log_w("Scan: createPeriodicSync not supported (BLE 5.0 unavailable)");
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEScan::receivePeriodicSync(uint16_t connHandle, uint16_t skipCount, uint16_t timeoutMs) {
#if BLE5_SUPPORTED && defined(BLE_GAP_EVENT_PERIODIC_TRANSFER)
  BLE_CHECK_IMPL(BTStatus::InvalidState);

  struct ble_gap_periodic_sync_params params = {};
  params.skip = skipCount;
  params.sync_timeout = timeoutMs / 10;

