lucasssvaz/arduino-esp32/libraries/BLE/src/scan/BLEScan.nimble.cpp
  int rc = ble_gap_periodic_adv_sync_receive(connHandle, &params, BLEScan::Impl::gapEventHandler, &impl);
  if (rc != 0) {
    log_e("ble_gap_periodic_adv_sync_receive: rc=%d conn=%u", rc, (unsigned)connHandle);
    return BTStatus::Fail;
  }
  log_i("Scan: PAST receive enabled on conn %u", (unsigned)connHandle);
  return BTStatus::OK;
#else
  (void)connHandle;
  (void)skipCount;
  (void)timeoutMs;
  log_w("Scan: receivePeriodicSync not supported (PAST unavailable)");
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEScan::cancelPeriodicSyncReceive(uint16_t connHandle) {
#if BLE5_SUPPORTED && defined(BLE_GAP_EVENT_PERIODIC_TRANSFER)
  int rc = ble_gap_periodic_adv_sync_receive(connHandle, NULL, NULL, NULL);
  if (rc != 0) {
    log_e("Scan: cancelPeriodicSyncReceive conn=%u rc=%d", (unsigned)connHandle, rc);
    return BTStatus::Fail;
  }
  return BTStatus::OK;
#else
  (void)connHandle;
  log_w("Scan: cancelPeriodicSyncReceive not supported (PAST unavailable)");
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEScan::cancelPeriodicSync() {
#if BLE5_SUPPORTED
  int rc = ble_gap_periodic_adv_sync_create_cancel();
  if (rc != 0) {
    log_e("Scan: cancelPeriodicSync failed rc=%d", rc);
    return BTStatus::Fail;
  }
  return BTStatus::OK;
#else
  log_w("Scan: cancelPeriodicSync not supported (BLE 5.0 unavailable)");
  return BTStatus::NotSupported;
#endif
}

BTStatus BLEScan::terminatePeriodicSync(uint16_t syncHandle) {
#if BLE5_SUPPORTED
  int rc = ble_gap_periodic_adv_sync_terminate(syncHandle);
  if (rc != 0) {
    log_e("Scan: terminatePeriodicSync handle=%u rc=%d", syncHandle, rc);
    return BTStatus::Fail;
  }
  if (_impl) {
    BLELockGuard lock(_impl->mtx);
    auto &v = _impl->periodicSyncs;
    v.erase(std::remove(v.begin(), v.end(), syncHandle), v.end());
  }
  return BTStatus::OK;
#else
  log_w("Scan: terminatePeriodicSync not supported (BLE 5.0 unavailable)");
  return BTStatus::NotSupported;
#endif
}

// Internal teardown hook (see BLEScan.h). Runs from BLEClass::end() while the
// NimBLE host is still enabled, so terminating here avoids the benign
// BLE_HS_EDISABLED race that occurs if a sync is left active across host stop.
void BLEScan::terminateAllPeriodicSyncs() {
#if BLE5_SUPPORTED
  if (!_impl) {
    return;
  }
  std::vector<uint16_t> handles;
  {
    BLELockGuard lock(_impl->mtx);
    handles.swap(_impl->periodicSyncs);
  }
  for (uint16_t h : handles) {
    ble_gap_periodic_adv_sync_terminate(h);
  }
#endif
}

#else /* !BLE_SCANNING_SUPPORTED -- stubs */

// Stubs for BLE_SCANNING_SUPPORTED == 0: log; start* return NotSupported or empty results/scan.

void BLEScan::clearDuplicateCache() {
  log_w("Scanning not supported");
}

BTStatus BLEScan::start(uint32_t, bool) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BLEScan::Results BLEScan::startBlocking(uint32_t) {
  log_w("Scanning not supported");
  return BLEScan::Results();
}

BTStatus BLEScan::stop() {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::startExtended(uint32_t, const ExtScanConfig *, const ExtScanConfig *) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::stopExtended() {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::createPeriodicSync(const BTAddress &, uint8_t, uint16_t, uint16_t) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::receivePeriodicSync(uint16_t, uint16_t, uint16_t) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::cancelPeriodicSyncReceive(uint16_t) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::cancelPeriodicSync() {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

BTStatus BLEScan::terminatePeriodicSync(uint16_t) {
  log_w("Scanning not supported");
  return BTStatus::NotSupported;
}

void BLEScan::terminateAllPeriodicSyncs() {}

#endif /* BLE_SCANNING_SUPPORTED */

#endif /* BLE_NIMBLE */
